espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
  if ( mpi->n < ECC_BIGINT_SIZE_IN_32BIT_WORDS ) {
    memcpy(bigint, mpi->p, mpi->n * sizeof(uint32_t));
    memset(&bi[mpi->n], 0, ECC_BIGINT_SIZE_IN_BYTES - (mpi->n * sizeof(uint32_t) ));
  } else {
    /* mpi has more room than bigint, so only store up to sizeof(bigint) */
    memcpy(bigint, mpi->p, ECC_BIGINT_SIZE_IN_BYTES);
  }
}

/***************************************************************************//**
 * @brief
 *   Set a range of bytes in a crypto bigint to a given value
 ******************************************************************************/
__STATIC_INLINE void bigint_set_bytes(ecc_bigint_t bigint,
                                      uint8_t value,
                                      size_t offset,
                                      size_t length)
{
  if ( (offset % sizeof(bigint[0]) == 0) && (length % sizeof(bigint[0]) == 0) ) {
    /* if we're writing full members, no need to account for endianness */
    memset(&bigint[offset / sizeof(bigint[0])], value, length);
  } else {
    /* Do an endianness-agnostic memset */
    for (; length > 0; length-- ) {
      bigint[offset / sizeof(bigint[0])] =
        (bigint[offset / sizeof(bigint[0])] & ~(0xFF << (offset % sizeof(bigint[0]))))
        | (value << (offset % sizeof(bigint[0])));
    }
  }
}

/***************************************************************************//**
 * @brief
 *   Returns true if the value of the DDATA0 register is equal to zero.
 ******************************************************************************/
__STATIC_INLINE bool crypto_ddata0_is_zero(CRYPTO_TypeDef* crypto,
                                           uint32_t*       status_reg)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_CRITICAL();
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_CCLR,
                   CRYPTO_CMD_INSTR_DEC,    /* Decrement by one which will set
                                               carry bit if DDATA0 is zero. */
                   CRYPTO_CMD_INSTR_INC     /* Increment in order to restore
                                               original value. */
                   );

  *status_reg = crypto->DSTATUS;
  CORE_EXIT_CRITICAL();

  return (*status_reg & CRYPTO_DSTATUS_CARRY) == CRYPTO_DSTATUS_CARRY;
}

/***************************************************************************//**
 * @brief
 *   Modular division using CRYPTO hardware acceleration.
 *
 * @details
 *   This function computes R = X/Y mod(N) using CRYPTO hardware acceleration.
 *   The implementation is not a direct replacement plugin, i.e. alternative
 *   implementation, of an existing mbedtls function. This function is used
 *   internally in other CRYPTO plugin functions indirectly replacing
 *   mbedtls_mpi_inv_mod.
 *
 *  @param[in]  X        Dividend of modular division operation
 *  @param[in]  Y        Divisor of  modular division operation
 *  @param[in]  N        Modulus
 *  @param[out] R        The destination of the result
 *
 * @return N/A
 ******************************************************************************/
static void crypto_mpi_div_mod(CRYPTO_TypeDef *crypto,
                               ecc_bigint_t   X,
                               ecc_bigint_t   Y,
                               ecc_bigint_t   N,
                               ecc_bigint_t   R)
{
  uint32_t            D[9];
  uint32_t            status_reg;
  uint8_t             rdata;
  uint8_t             lsb_C;
  uint8_t             lsb_D;
  uint8_t             lsb_U;
  int                 t;
  int                 k;
  CORE_DECLARE_IRQ_STATE;

  /************** Initialize and organize data in crypto module **************/

  /*
  ** Register usage:
  **
  ** DDATA0 - holds temporary results and loads 260 bit variables in/out
  ** DDATA1 - variable referred to as 'C' in the following algorithm
  ** DDATA2 - variable referred to as 'U' in the following algorithm
  ** DDATA3 - variable referred to as 'D' in the following algorithm
  ** DDATA4 - variable referred to as 'W' in the following algorithm
  */

  EC_BIGINT_COPY(D, N);               /* D will hold the modulus (n) initially */
  D[8] = 0;                           /* Set MSWord of D to 0. */

  CORE_ENTER_CRITICAL();
  CRYPTO_DDataWrite(&crypto->DDATA1, Y);    /* Set C to Y (divisor) initially */
  CRYPTO_DDataWrite(&crypto->DDATA2, X);    /* Set U to X (dividend)initially */
  CRYPTO_DDataWrite(&crypto->DDATA3, N);    /* Set D to modulus p initially   */
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_CLR,              /* DDATA0 = 0 */
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4,   /* Set W to zero initially*/
                   CRYPTO_CMD_INSTR_DDATA1TODDATA0);  /* DDATA0 = C initially */

  t     = 0;
  k     = 1;

  /******************* Run main loop while 'C' is non-zero ********************/

  /* while (C != 1024'd0)  */
  while ( !crypto_ddata0_is_zero(crypto, &status_reg) ) {
    lsb_C = (status_reg & _CRYPTO_DSTATUS_DDATA0LSBS_MASK) >> _CRYPTO_DSTATUS_DDATA0LSBS_SHIFT;
    if ((lsb_C & 0x1) == 0) {
      CRYPTO_EXECUTE_3(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA1DDATA1,
                       CRYPTO_CMD_INSTR_SHRA,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA1
                       );
      t = t - 1;
    } else {
      if (t < 0) {
        CRYPTO_EXECUTE_6(crypto,
                         CRYPTO_CMD_INSTR_DDATA2TODDATA0,
                         CRYPTO_CMD_INSTR_DDATA4TODDATA2,
                         CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                         CRYPTO_CMD_INSTR_DDATA1TODDATA0,
                         CRYPTO_CMD_INSTR_DDATA3TODDATA1,
                         CRYPTO_CMD_INSTR_DDATA0TODDATA3);
        CORE_ENTER_CRITICAL();
        CRYPTO_DDATA0_260_BITS_READ(crypto, D);
        CORE_EXIT_CRITICAL();
        t = -t;
      }

      k = 1;

      CRYPTO_EXECUTE_2(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                       CRYPTO_CMD_INSTR_ADD);

      rdata = CRYPTO_DData0_4LSBitsRead(crypto);

      if ((rdata & 0x3) != 0x0) {
        k = -1;
      } else {
        t = t - 1;
      }

      /*  R1 = C >> 1  */
      crypto->CMD = CRYPTO_CMD_INSTR_DDATA1TODDATA0;       /* to get the lsb of C */

      lsb_C = CRYPTO_DData0_4LSBitsRead(crypto);
      CRYPTO_EXECUTE_4(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA1DDATA1,
                       CRYPTO_CMD_INSTR_SHRA,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                       CRYPTO_CMD_INSTR_DDATA3TODDATA0);       /* to get the lsb of D(R3) */

      /*  R3 = D >> 1  */
      lsb_D = CRYPTO_DData0_4LSBitsRead(crypto);

      CRYPTO_EXECUTE_2(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA3DDATA3,
                       CRYPTO_CMD_INSTR_SHRA);

