espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
      if (k == 1) {
        if (((lsb_C & 0x1) == 0x1) && ((lsb_D & 0x1) == 0x1)) {
          CRYPTO_EXECUTE_7(crypto,
                           /*  C = R1+R3+1  */
                           CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                           CRYPTO_CMD_INSTR_CSET,
                           CRYPTO_CMD_INSTR_ADDC,
                           CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                           /*  U = mod(R2+R4,n)  */
                           CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                           CRYPTO_CMD_INSTR_MADD,
                           CRYPTO_CMD_INSTR_DDATA0TODDATA2
                           );
        } else {
          CRYPTO_EXECUTE_6(crypto,
                           /*  C = R1+R3  */
                           CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                           CRYPTO_CMD_INSTR_ADD,
                           CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                           /*  U = mod(R2+R4,n)  */
                           CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                           CRYPTO_CMD_INSTR_MADD,
                           CRYPTO_CMD_INSTR_DDATA0TODDATA2
                           );
        }
      } else {
        if (k == -1) {
          if (((lsb_C & 0x1) == 0x0) && ((lsb_D & 0x1) == 0x1)) {
            CRYPTO_EXECUTE_8(crypto,
                             /*  C = R1-R3-1  */
                             CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                             CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                             CRYPTO_CMD_INSTR_CSET,
                             CRYPTO_CMD_INSTR_SUBC,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                             /*  U = mod(R2-R4,p)  */
                             CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                             CRYPTO_CMD_INSTR_MSUB,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2
                             );
          } else {
            CRYPTO_EXECUTE_7(crypto,
                             /*  C = R1+R3  */
                             CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                             CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                             CRYPTO_CMD_INSTR_SUB,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                             /*  U = mod(R2-R4,p)  */
                             CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                             CRYPTO_CMD_INSTR_MSUB,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2
                             );
          }

          CRYPTO_DDATA0_260_BITS_WRITE(crypto, D);
          crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA3;
        }         /* if (k == -1) */
      }
    }     /* else: !if((C[31:0] & 0x1) == 0x0) */

    crypto->CMD = CRYPTO_CMD_INSTR_DDATA2TODDATA0;

    lsb_U = CRYPTO_DData0_4LSBitsRead(crypto);

    /* if ((U[31:0] & 0x1) == 0x1) */
    if ((lsb_U & 0x1) == 0x1) {
      CRYPTO_EXECUTE_3(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                       CRYPTO_CMD_INSTR_SHRA,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA2);

      CORE_ENTER_CRITICAL();
      CRYPTO_DDataWrite(&crypto->DDATA0, N);
      CORE_EXIT_CRITICAL();

      CRYPTO_EXECUTE_6(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                       CRYPTO_CMD_INSTR_SHR,
                       CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                       CRYPTO_CMD_INSTR_CSET,
                       CRYPTO_CMD_INSTR_ADDC,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA2);
    } else {
      CRYPTO_EXECUTE_3(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                       CRYPTO_CMD_INSTR_SHRA,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA2);
    }

    /* DDATA0 = C */
    crypto->CMD = CRYPTO_CMD_INSTR_DDATA1TODDATA0;
  }   /* End of main loop:  while (C != 0)  */

  /* if (D == 1): */
  /* Decrement D by 1 and test if zero. */
  CRYPTO_EXECUTE_2(crypto,
                   CRYPTO_CMD_INSTR_DDATA3TODDATA0,
                   CRYPTO_CMD_INSTR_DEC);

  if (crypto_ddata0_is_zero(crypto, &status_reg)) {
    CORE_ENTER_CRITICAL();
    CRYPTO_DDataRead(&crypto->DDATA4, R);
    CORE_EXIT_CRITICAL();
  } else {
    CORE_ENTER_CRITICAL();
    CRYPTO_DDataWrite(&crypto->DDATA0, N);
    CORE_EXIT_CRITICAL();

    CRYPTO_EXECUTE_2(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                     CRYPTO_CMD_INSTR_SUB
                     );

    CORE_ENTER_CRITICAL();
    CRYPTO_DDataRead(&crypto->DDATA0, R);
    CORE_EXIT_CRITICAL();
  }
  return;
} /* crypto_mpi_div_mod  */
#endif /* MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT || MBEDTLS_ECP_NORMALIZE_JAC_ALT */

/***************************************************************************//**
 * @brief
 *   Enable CRYPTO by setting up control registers for given ecc curve.
 ******************************************************************************/
static int ecp_crypto_device_init(CRYPTO_TypeDef *device, const mbedtls_ecp_group *grp)
{
  int             ret = 0;

  /* Setup CRYPTO registers for ECC operation */
  device->CTRL     = 0;
  device->SEQCTRL  = CRYPTO_SEQCTRL_BLOCKSIZE_32BYTES | 32;
  device->SEQCTRLB = 0;

  switch ( grp->id ) {
#if defined(MBEDTLS_ECP_DP_SECP192R1_ENABLED)
    case MBEDTLS_ECP_DP_SECP192R1:
      CRYPTO_ModulusSet(device, cryptoModulusEccP192);
      CRYPTO_MulOperandWidthSet(device, cryptoMulOperandModulusBits);
      CRYPTO_ResultWidthSet(device, cryptoResult256Bits);
      break;
#endif /* MBEDTLS_ECP_DP_SECP192R1_ENABLED */

#if defined(MBEDTLS_ECP_DP_SECP224R1_ENABLED)
    case MBEDTLS_ECP_DP_SECP224R1:
      CRYPTO_ModulusSet(device, cryptoModulusEccP224);
      CRYPTO_MulOperandWidthSet(device, cryptoMulOperandModulusBits);
      CRYPTO_ResultWidthSet(device, cryptoResult256Bits);
      break;
#endif /* MBEDTLS_ECP_DP_SECP224R1_ENABLED */

#if defined(MBEDTLS_ECP_DP_SECP256R1_ENABLED)
    case MBEDTLS_ECP_DP_SECP256R1:
      CRYPTO_ModulusSet(device, cryptoModulusEccP256);
      CRYPTO_MulOperandWidthSet(device, cryptoMulOperandModulusBits);
      CRYPTO_ResultWidthSet(device, cryptoResult260Bits);
      break;
#endif /* MBEDTLS_ECP_DP_SECP256R1_ENABLED */

    default:
      ret = MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED;
      break;
  }

  return(ret);
}

/***************************************************************************//**
 * @brief
 *   Write 256 bits of data to a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Write 256 bits of data into a DDATAX (Double Data) register in the crypto
 *   module.
 *
 *  @param[in]  ddataReg   Data register identifier
 *  @param[in]  val        Value of the data to write to the DDATA register.
 ******************************************************************************/
__STATIC_INLINE void ecp_crypto_ddata_write(CRYPTO_DDataReg_TypeDef  ddataReg,
                                            const mbedtls_mpi*       mpi)
{
  uint32_t volatile* regPtr = (volatile uint32_t *) ddataReg;
  uint32_t* pVal = mpi->p;
  register uint32_t v0;
  register uint32_t v1;
  register uint32_t v2;
  register uint32_t v3;
  int      i;

