espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
  if (mpi->n < 4) {
    /* Non optimal write of data. */
    for (i = 0; i < (int)mpi->n; i++) {
      *regPtr = *pVal++;
    }
    for (; i < 8; i++) {
      *regPtr = 0;
    }
  } else {
    if (mpi->n < 8) {
      /* Optimal write of first 4 words. */
      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;

      /* Non optimal write of remaining words */
      for (i = 4; i < (int)mpi->n; i++) {
        *regPtr = *pVal++;
      }
      for (; i < 8; i++) {
        *regPtr = 0;
      }
    } else {
      /* Optimal write of all data. */
      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;

      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;
    }
  }
}

/***************************************************************************//**
 * @brief
 *   Read 256 bits of data from a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Read 256 bits of data from a DDATAX (Double Data) register in the crypto
 *   module.
 *
 *  @param[in]  ddataReg   Data register identifier
 *  @param[out] val        Location where to store the value in memory.
 ******************************************************************************/
__STATIC_INLINE int ecp_crypto_ddata_read(CRYPTO_DDataReg_TypeDef  ddataReg,
                                          mbedtls_mpi*             mpi)
{
  CRYPTO_DData_TypeDef  ddata;
  uint32_t              val32;
  int                   i;
  int                   used;
  int                   ret = 0;
  CORE_DECLARE_IRQ_STATE;

  if (mpi->n == 8) {
    CORE_ENTER_CRITICAL();
    CRYPTO_DDataRead(ddataReg, mpi->p);
    CORE_EXIT_CRITICAL();
  } else {
    if (mpi->n > 8) {
      CORE_ENTER_CRITICAL();
      CRYPTO_DDataRead(ddataReg, mpi->p);
      CORE_EXIT_CRITICAL();
      memset(&mpi->p[8], 0, sizeof(uint32_t) * (mpi->n - 8));
    } else {
      uint32_t volatile* regPtr = (volatile uint32_t*) ddataReg;
      used = 0;
      for (i = 0; i < 8; i++) {
        ddata[i] = val32 = *regPtr;
        if (val32) {
          used = i + 1;
        }
      }
      if (used > (int)mpi->n) {
        SLCL_ECP_CHK(mbedtls_mpi_grow(mpi, used) );
        memcpy(mpi->p, ddata, used * sizeof(uint32_t));
        mpi->s = 1;
      } else {
        memcpy(mpi->p, ddata, mpi->n * sizeof(uint32_t));
      }
    }
  }
  cleanup:
  return(ret);
}

#if defined(MBEDTLS_ECP_RANDOMIZE_JAC_ALT)
/**
 * \brief           Randomize jacobian coordinates:
 *                  (X, Y, Z) -> (l^2 X, l^3 Y, l Z) for random l.
 *
 * \param grp       Pointer to the group representing the curve.
 *
 * \param pt        The point on the curve to be randomised, given with Jacobian
 *                  coordinates.
 *
 * \param f_rng     A function pointer to the random number generator.
 *
 * \param p_rng     A pointer to the random number generator state.
 *
 * \return          0 if successful.
 */
int mbedtls_internal_ecp_randomize_jac(const mbedtls_ecp_group *grp,
                                       mbedtls_ecp_point *pt,
                                       int (*f_rng)(void *, unsigned char *, size_t),
                                       void *p_rng)
{
  int ret;
  ecc_bigint_t l = { 0 };
  CORE_DECLARE_IRQ_STATE;
  CRYPTO_TypeDef *crypto;
  int count = 0;

  /* Strategy:
   *  1) Generate l such that 1 < l < p
   *  2) Z = l (R1) * Z (R4)
   *  3) ll (R1) = l (R4) * l
   *  4) X = ll (R1) * X (R2)
   *  5) lll (R1) = ll (R1) * l (R4)
   *  6) Y = lll (R1) * Y (R3)
   */

  start:
  /*  Allow a maximum of 10 failed attempts before
   *  concluding that the RNG has failed. */
  if ( count == 10 ) {
    return MBEDTLS_ERR_ECP_RANDOM_FAILED;
  }

  /* Since the modulus operation in hardware treats bits over the modulus length
   * as don't-care, we need to zero these out to avoid them being taken along in
   * the modular-multiplication operation. */
  switch (grp->id) {
    case MBEDTLS_ECP_DP_SECP256R1:
      ret = f_rng(p_rng, (unsigned char *)l, sizeof(l));
      break;
    case MBEDTLS_ECP_DP_SECP224R1:
      ret = f_rng(p_rng, (unsigned char *)l, 224 / 8);
      bigint_set_bytes(l, 0, 224 / 8, sizeof(ecc_bigint_t) - (224 / 8));
      break;
    case MBEDTLS_ECP_DP_SECP192R1:
      ret = f_rng(p_rng, (unsigned char *)l, 192 / 8);
      bigint_set_bytes(l, 0, 192 / 8, sizeof(ecc_bigint_t) - (192 / 8));
      break;
    default:
      return MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED;
  }
  if ( ret != 0 ) {
    return(ret);
  }

  crypto = crypto_management_acquire();
  ecp_crypto_device_init(crypto, grp);

  CORE_ENTER_CRITICAL();
  CRYPTO_DDataWrite(&crypto->DDATA1, l);
  CORE_EXIT_CRITICAL();

  /* In order to ensure that 1 < l < p, we will perform a modular reduction
   * of l mod p. This is done by using MADD with l and 0 (where 0 is achieved
   * by clearing DDATA0). Additionally, the resulting value of l is checked
   * to assure that it is not equal to zero or one. */
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_CLR,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                   CRYPTO_CMD_INSTR_MADD);
  CRYPTO_InstructionSequenceWait(crypto);

  /* Most efficient in the average case to only check
   * the value of the least significant word. */
  CORE_ENTER_CRITICAL();
  CRYPTO_DDataRead(&crypto->DDATA0, l);
  CORE_EXIT_CRITICAL();
  if ( l[0] <= 1 ) {
    crypto_management_release(crypto);
    ++count;
    goto start;
  }

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA2, &pt->X);
  ecp_crypto_ddata_write(&crypto->DDATA3, &pt->Y);
  ecp_crypto_ddata_write(&crypto->DDATA4, &pt->Z);
  CORE_EXIT_CRITICAL();

  /* Compute Z' = l * Z. */
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);

  MBEDTLS_MPI_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &pt->Z) );

