espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
  /* X = l^2 * X */
  CRYPTO_EXECUTE_6(crypto,
                   CRYPTO_CMD_INSTR_DDATA1TODDATA4,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);

  MBEDTLS_MPI_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &pt->X) );

  /* Y = l^3 * Y */
  CRYPTO_EXECUTE_5(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);

  MBEDTLS_MPI_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &pt->Y) );

  cleanup:
  crypto_management_release(crypto);
  return(ret);
}
#endif /* MBEDTLS_ECP_RANDOMIZE_JAC_ALT */

#if defined(MBEDTLS_ECP_ADD_MIXED_ALT)
/**
 * \brief           Addition: R = P + Q, mixed affine-Jacobian coordinates.
 *
 *                  The coordinates of Q must be normalized (= affine),
 *                  but those of P don't need to. R is not normalized.
 *
 *                  This function is used only as a subrutine of
 *                  ecp_mul_comb().
 *
 *                  Special cases: (1) P or Q is zero, (2) R is zero,
 *                      (3) P == Q.
 *                  None of these cases can happen as intermediate step in
 *                  ecp_mul_comb():
 *                      - at each step, P, Q and R are multiples of the base
 *                      point, the factor being less than its order, so none of
 *                      them is zero;
 *                      - Q is an odd multiple of the base point, P an even
 *                      multiple, due to the choice of precomputed points in the
 *                      modified comb method.
 *                  So branches for these cases do not leak secret information.
 *
 *                  We accept Q->Z being unset (saving memory in tables) as
 *                  meaning 1.
 *
 *                  Cost in field operations if done by [5] 3.22:
 *                      1A := 8M + 3S
 *
 * \param grp       Pointer to the group representing the curve.
 *
 * \param R         Pointer to a point structure to hold the result.
 *
 * \param P         Pointer to the first summand, given with Jacobian
 *                  coordinates
 *
 * \param Q         Pointer to the second summand, given with affine
 *                  coordinates.
 *
 * \return          0 if successful.
 */
int mbedtls_internal_ecp_add_mixed(const mbedtls_ecp_group *grp,
                                   mbedtls_ecp_point *R,
                                   const mbedtls_ecp_point *P,
                                   const mbedtls_ecp_point *Q)
{
  int             ret;
  CORE_DECLARE_IRQ_STATE;

  /*
   * Trivial cases: P == 0 or Q == 0 (case 1)
   */
  if ( mbedtls_ecp_is_zero((mbedtls_ecp_point *)P) ) {
    return(mbedtls_ecp_copy(R, Q) );
  }

  if ( Q->Z.p != NULL && mbedtls_ecp_is_zero((mbedtls_ecp_point *)Q) ) {
    return(mbedtls_ecp_copy(R, P) );
  }

  /*
   * Make sure Q coordinates are normalized
   */
  if ( Q->Z.p != NULL && mbedtls_mpi_cmp_int(&Q->Z, 1) != 0 ) {
    return(MBEDTLS_ERR_ECP_BAD_INPUT_DATA);
  }

  CRYPTO_TypeDef *crypto = crypto_management_acquire();

  ecp_crypto_device_init(crypto, grp);

  /*
     STEP 1:

     Goals:
     A = Qx*Pz^2
     B = Qy*Pz^3

     Write Operations:

     R0 = Pz
     R0 = Qx
     R0 = Qy

     Instructions to be executed:

     1. R0 = DMA = Pz
     2. R1 = R0 = Pz
     3. R2 = R0 = Pz
     4. Select R1, R2
     5. R0 = R1 * R2 = Pz^2
     6. R1 = R0 = Pz^2

     7.  R0 = DMA = Qx
     8.  R3 = R0 = Qx
     9.  Select R1, R3
     10. R0 = R1 * R3 = Qx * Pz^2
     11. R3 = R0 = Qx * Pz^2

     12. Select R1, R2
     13. R0 = R1 * R2 = Pz^3
     14. R1 = R0 = Pz^3

     15. R0 = DMA = Qy
     16. R4 = R0 = Qx
     17. Select R1, R4
     18. R0 = R1 * R4 = Qy * Pz^3
     19. Select R0, R1  (for MSUB in step 2)

     Output State:
     R0   = B
     R1   = FREE
     R2   = FREE
     R3   = A
     R4   = Pz

     STEP 1:
   */
  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &P->Z);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_5(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1);
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &Q->X);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_4(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3);
  CRYPTO_InstructionSequenceWait(crypto);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1);
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &Q->Y);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  /*
     STEP 2:

     Goals:
     C  = A - Px
     D  = B - Py
     R->Z = Pz * C

     Write Operations:

     R1 = Py
     R0 = Px (via DMA)

     Input State:
     R0   = B
     R1   = Py
     R2   = FREE
     R3   = A
     R4   = Pz

     Instructions to be executed:

     0. Select R0, R1
     1. R0 = R0 - R1 = B - Py = D
     2. R2 = R0 = D
     3. R1 = R3 = A
     4. R0 = DMA = Px
     5. R3 = R0 = Px
     6. Select R1, R3
     7. R0 = R1 - R3 = A - Px = C
     8. R1 = R0 = C
     9. Select R1, R4
     10. R0 = R1 * R4 = Pz * C = R->Z

