espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
     Read Operations:

     R->Z = R0 = Pz * C

     Output State:
     R0   = FREE
     R1   = C
     R2   = D
     R3   = Px
     R4   = FREE

     STEP 2:
   */

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA1, &P->Y);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                   CRYPTO_CMD_INSTR_MSUB,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2);    /* R2 = D */
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &P->X);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_7(crypto,
                   CRYPTO_CMD_INSTR_DDATA3TODDATA1,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MSUB,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,     /* R1 = C */

                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  ret = ecp_crypto_ddata_read(&crypto->DDATA0, &R->Z);

  if (ret != 0) {
    goto cleanup;
  }

  /*
     STEP 3:

     Goals:
     X1C2  = Px * C^2
     C3    = C^3
     D2    = D^2

     Input State:
     R0   = FREE
     R1   = C
     R2   = D
     R3   = Px
     R4   = FREE

     Instructions to be executed:

     1. R4 = R1 = C
     2. Select R1, R4
     3. R0 = R1 * R4 = C^2
     4. R1 = R0 = C^2
     5. R0 = R1 * R4 = C^3
     6. R4 = R0 = C^3
     7. Select R1, R3
     8. R0 = R1 * R3 = Px * C^2
     9. R3 = R0 = Px * C^2
     10. R1 = R2 = D
     11. Select R1, R1
     12. R0 = R1 * R1 = D^2
     13. Select R0, R4
     14. R0 = R0 - R4 = D2 - C3

     Output state:

     R0 = D2 - C3
     R1 = FREE
     R2 = D
     R3 = X1C2 = Px * C^2
     R4 = C3   = C^3

     STEP 3:
   */
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA1TODDATA4,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4);
  CRYPTO_InstructionSequenceWait(crypto);

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3);
  CRYPTO_InstructionSequenceWait(crypto);

  CRYPTO_EXECUTE_5(crypto,
                   CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                   CRYPTO_CMD_INSTR_MSUB
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  /*
     STEP 3:

     Goals:
     R->X   = D2 - (C3 + 2 * X1C2) = D2 - C3 - X1C2- X1C2
     Y1C3 = Py * C3
     R->Y = D * (X1C2 - R->X) - Y1C3

     Write Operations:
     R1 = Py

     Input State:
     R0 = D2 - C3
     R1 = FREE
     R2 = D
     R3 = X1C2
     R4 = C3

     Instructions to be executed:

     1.  Select R0, R3
     2.  R0 = R0 - R3 = D2 - C3 - X1C2
     3.  R0 = R0 - R3 = D2 - C3 - X1C2 - X1C2 = R->X
     4.  DMA = R0 = R->X
     5.  R1 = R0 = R->X

     6.  Select R3, R1
     7.  R0 = R3 - R1 = X1C2 - R->X
     8.  R1 = R0 = X1C2 - R->X
     9.  Select R1, R2
     10. R0 = R1 * R2 = D *(X1C2 - R->X)
     11. R2 = R0

     12. R0 = DMA = Py
     13. R1 = R0 = Py
     14. Select R1, R4
     15. R0 = R1 * R4 = Py * C3 = Y1C3
     16. R4 = R0 = Y1C3

     17. Select R2, R4
     18. R0 = R2 - R4

     Read Operations:

     R->X = R2 = D2 - (C3 + 2 * X1C2)
     R->Y = R0 = D * (X1C2 - R->X) - Y1C3

     STEP 4:
   */

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                   CRYPTO_CMD_INSTR_MSUB,
                   CRYPTO_CMD_INSTR_MSUB);
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &R->X));

  CRYPTO_EXECUTE_7(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,

                   CRYPTO_CMD_INSTR_SELDDATA3DDATA1,
                   CRYPTO_CMD_INSTR_MSUB,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2);
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &P->Y);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_6(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4,

                   CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                   CRYPTO_CMD_INSTR_MSUB
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &R->Y));

  cleanup:
  crypto_management_release(crypto);
  return (ret);
}
#endif /* MBEDTLS_ECP_ADD_MIXED_ALT */

/**
 * \brief           Point doubling R = 2 P, Jacobian coordinates.
 *
 *                  Cost:   1D := 3M + 4S    (A ==  0)
 *                          4M + 4S          (A == -3)
 *                          3M + 6S + 1a     otherwise
 *                  when the implementation is based on the "dbl-1998-cmo-2"
 *                  doubling formulas in [8] and standard optimizations are
 *                  applied when curve parameter A is one of { 0, -3 }.
 *
 * \param grp       Pointer to the group representing the curve.
 *
 * \param R         Pointer to a point structure to hold the result.
 *
 * \param P         Pointer to the point that has to be doubled, given with
 *                  Jacobian coordinates.
 *
 * \return          0 if successful.
 */
#if defined(MBEDTLS_ECP_DOUBLE_JAC_ALT)
int mbedtls_internal_ecp_double_jac(const mbedtls_ecp_group *grp,
                                    mbedtls_ecp_point *R,
                                    const mbedtls_ecp_point *P)
{
  int             ret;
  CORE_DECLARE_IRQ_STATE;
  CRYPTO_TypeDef *crypto = crypto_management_acquire();

