espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
  ecp_crypto_device_init(crypto, grp);

  ecc_bigint_t _2YY;
  /*
     STEP 1:

     Goals:
     ZZ   = Z^2
     R->Z = 2 * Y * Z
     YY   = Y^2
     4YY  = 4 * Y^2

     Write Operations:

     R2 = Y
     R3 = Z

     Instructions to be executed:

     1.  R0 = DMA = Z
     2.  R1 = R0 = Z
     3.  R2 = R0 = Z
     4.  Select R1, R2
     5.  R0 = R1 * R2 = Z^2 = ZZ
     6.  R3 = R0 = ZZ

     7.  R0 = DMA = Y
     8.  R2 = R0 = Y
     9.  R0 = R1 * R2 = Y * Z
     10. Select R0, R0
     11. R0 = R0 + R0 = 2 * Y * Z = R->Z

     12. DMA = R0 = R->Z

     13. R1 = R2 = Y
     14. Select R1, R2
     15. R0 = R1 * R2 = Y^2 = YY
     16.  Select R0, R0
     17.  R0 = R0 + R0 = 2YY

     Read Operations:

     R->Z = R0 = 2 * Y * Z
     2YY  = R0

     Output State:
     R0 = 2YY
     R1 = FREE
     R2 = FREE
     R3 = ZZ
     R4 = FREE

     STEP 1:
   */
  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &P->Z);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_5(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3);
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA0, &P->Y);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_4(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                   CRYPTO_CMD_INSTR_MADD);
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &R->Z));

  CRYPTO_EXECUTE_5(crypto,
                   CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                   CRYPTO_CMD_INSTR_MADD
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  CORE_ENTER_CRITICAL();
  ecp_crypto_ddata_write(&crypto->DDATA4, &P->X);
  CRYPTO_DDataRead(&crypto->DDATA0, _2YY);
  CORE_EXIT_CRITICAL();

  /*
     STEP 2:

     Goals:
     A   = 4YY * X
     C   = 3(X - ZZ)(X + ZZ)

     Write Operations:

     R4 = X

     Input State:
     R0 = 2YY
     R1 = FREE
     R2 = FREE
     R3 = ZZ
     R4 = X

     Instructions to be executed:

     1.  R0 = R0 + R0 = 4YY
     2.  R1 = R0 = 4YY
     3.  Select R1, R4
     4.  R0 = R1 * R4 = 4YY * X = A
     5.  R2 = R0 = A
     6.  Select R4, R3
     7.  R0 = R4 + R3 = X + ZZ
     8.  R1 = R0 = X + ZZ
     9.  R0 = R4 - R3 = X - ZZ
     0.  R2 = R0 = X - ZZ
     11. Select R1, R2
     12. R0 = R1 * R2 = (X + ZZ)(X - ZZ)
     13. R1 = R0 = (X + ZZ)(X - ZZ)
     14. Select R0, R1
     15. R0 = R0 + R1 = 2(X + ZZ)(X - ZZ)
     16. R0 = R0 + R1 = 3(X + ZZ)(X - ZZ) = C
     17. R1 = R0 = C

     Output State:
     R0 = FREE
     R1 = C
     R2 = A
     R3 = FREE
     R4 = FREE

     STEP 2:
   */
  CRYPTO_EXECUTE_11(crypto,
                    CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                    CRYPTO_CMD_INSTR_MADD,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                    CRYPTO_CMD_INSTR_SELDDATA4DDATA3,
                    CRYPTO_CMD_INSTR_MADD,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                    CRYPTO_CMD_INSTR_MSUB,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA4);
  CRYPTO_InstructionSequenceWait(crypto);
  CRYPTO_EXECUTE_7(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                   CRYPTO_CMD_INSTR_MADD,
                   CRYPTO_CMD_INSTR_MADD,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1
                   );
  CRYPTO_InstructionSequenceWait(crypto);
  /*
     STEP 3:

     Goals:
     R->X = C^2 - 2A
     D = C(A - R->X)

     Input State:
     R0 = FREE
     R1 = C
     R2 = A
     R3 = FREE
     R4 = FREE

     Instructions to be executed:

     1.  R4 = R1 = C
     2.  Select R1, R4
     3.  R0 = R1 * R4 = C^2
     4.  Select R0, R2
     5.  R0 = R0 - R2 = C^2 - 2A = R->X
     6.  R4 = R0 = R->X
     7.  Select R3, R4
     8.  R0 = R3 - R4 = A - R->X
     9.  R2 = R0 = A - R->X
     10  Select R1, R2
     11. R0 = R1 * R2 = C(A - R->X) = D

     Read Operations:

     R->X = R4 = C^2 - 2A

     Output State:
     R0   = FREE
     R1   = FREE
     R2   = FREE
     R3   = D
     R4   = FREE

     STEP 3:
   */

  CRYPTO_EXECUTE_8(crypto,
                   CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                   CRYPTO_CMD_INSTR_MADD,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4,

                   CRYPTO_CMD_INSTR_DDATA1TODDATA3,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MMUL,

                   CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                   CRYPTO_CMD_INSTR_MSUB);
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &R->X));

  CRYPTO_EXECUTE_7(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA4,

                   CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                   CRYPTO_CMD_INSTR_MSUB,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  /*
     STEP 4:

     Goals:
     B    = 8 * Y^4
     R->Y = D - B

     Write Operations:

     R1 = YY

     Input State:
     R0   = FREE
     R1   = YY
     R2   = FREE
     R3   = D
     R4   = FREE

     Instructions to be executed:

     2. R0 = DMA0
     3. R1 = R0 = Y^2
     4. R2 = R0 = Y^2
     5. Select R1, R2
     6. R0 = R1 * R2 = Y^4
     7. Select R0, R0
     8. R0 = R0 + R0 = 2 * Y^4
     9. R0 = R0 + R0 = 4 * Y^4
     10. R0 = R0 + R0 = 8 * Y^4
     11. R2 = R0
     12. Select R3, R2
     13. R0 = R3 - R2 = D - B = R->Y

