espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
     Read Operations:

     R->Y = R0 = D - B

     STEP 4:
   */
  CORE_ENTER_CRITICAL();
  CRYPTO_DDataWrite(&crypto->DDATA0, _2YY);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_9(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL,

                   CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                   CRYPTO_CMD_INSTR_MADD,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2,

                   CRYPTO_CMD_INSTR_SELDDATA3DDATA2,
                   CRYPTO_CMD_INSTR_MSUB
                   );
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &R->Y));

  cleanup:
  crypto_management_release(crypto);

  return (ret);
}
#endif /* MBEDTLS_ECP_DOUBLE_JAC_ALT */

/**
 * \brief           Normalize jacobian coordinates of an array of (pointers to)
 *                  points.
 *
 *                  Using Montgomery's trick to perform only one inversion mod P
 *                  the cost is:
 *                      1N(t) := 1I + (6t - 3)M + 1S
 *                  (See for example Algorithm 10.3.4. in [9])
 *
 *                  This function is used only as a subrutine of
 *                  ecp_mul_comb().
 *
 *                  Warning: fails (returning an error) if one of the points is
 *                  zero!
 *                  This should never happen, see choice of w in ecp_mul_comb().
 *
 * \param grp       Pointer to the group representing the curve.
 *
 * \param T         Array of pointers to the points to normalise.
 *
 * \param t_len     Number of elements in the array.
 *
 * \return          0 if successful,
 *                      an error if one of the points is zero.
 */
#if defined(MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT)
int mbedtls_internal_ecp_normalize_jac_many(const mbedtls_ecp_group *grp,
                                            mbedtls_ecp_point *T[],
                                            size_t t_len)
{
  int ret = 0;
  size_t i;
  ecc_bigint_t*   cc;
  ecc_bigint_t    uu;
  ecc_bigint_t    one = { 0 };
  ecc_bigint_t    modulus;
  CORE_DECLARE_IRQ_STATE;

  if ( t_len < 2 ) {
    return(mbedtls_internal_ecp_normalize_jac(grp, *T) );
  }

  if ( (cc = mbedtls_calloc(t_len, sizeof(ecc_bigint_t) ) ) == NULL ) {
    return(MBEDTLS_ERR_ECP_ALLOC_FAILED);
  }

  /*
   * c[i] = Z_0 * ... * Z_i
   */
  MPI_TO_BIGINT(cc[0], &T[0]->Z);

  CRYPTO_TypeDef *crypto = crypto_management_acquire();
  ecp_crypto_device_init(crypto, grp);

  for ( i = 1; i < t_len; i++ ) {
    CORE_ENTER_CRITICAL();
    ecp_crypto_ddata_write(&crypto->DDATA1, &T[i]->Z);
    CRYPTO_DDataWrite(&crypto->DDATA2, cc[i - 1]);
    CORE_EXIT_CRITICAL();

    CRYPTO_EXECUTE_2(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL);
    CRYPTO_InstructionSequenceWait(crypto);

    CORE_ENTER_CRITICAL();
    CRYPTO_DDataRead(&crypto->DDATA0, cc[i]);
    CORE_EXIT_CRITICAL();
  }

  bigint_set_bytes(one, 1, 0, 1);
  MPI_TO_BIGINT(modulus, &grp->P);

  /*
   * u = 1 / (Z_0 * ... * Z_n) mod P
   */
  crypto_mpi_div_mod(crypto, one, cc[t_len - 1], modulus, uu);

  for ( i = t_len - 1;; i-- ) {
    /*
     * Zi = 1 / Z_i mod p
     * u = 1 / (Z_0 * ... * Z_i) mod P
     */
    if ( i == 0 ) {
      /* Z_inv (DDATA2) = uu */
      CORE_ENTER_CRITICAL();
      CRYPTO_DDataWrite(&crypto->DDATA2, uu);
      CORE_EXIT_CRITICAL();
    } else {
      /* Z_inv (DDATA1) = uu x cc[i-1] modulo p */
      /* uu = uu x T[i]->Z modulo p */
      CORE_ENTER_CRITICAL();
      CRYPTO_DDataWrite(&crypto->DDATA1, uu);
      CRYPTO_DDataWrite(&crypto->DDATA2, cc[i - 1]);
      ecp_crypto_ddata_write(&crypto->DDATA3, &T[i]->Z);
      CORE_EXIT_CRITICAL();

      CRYPTO_EXECUTE_3(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                       CRYPTO_CMD_INSTR_MMUL,
                       CRYPTO_CMD_INSTR_DDATA0TODDATA2);       /* Z_inv (DDATA2) */
      CRYPTO_InstructionSequenceWait(crypto);
      CRYPTO_EXECUTE_2(crypto,
                       CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                       CRYPTO_CMD_INSTR_MMUL);
      CRYPTO_InstructionSequenceWait(crypto);

      CORE_ENTER_CRITICAL();
      CRYPTO_DDataRead(&crypto->DDATA0, uu);
      CORE_EXIT_CRITICAL();
    }

    /*
     * proceed as in normalize()
     */
    CORE_ENTER_CRITICAL();
    ecp_crypto_ddata_write(&crypto->DDATA3, &T[i]->X);
    ecp_crypto_ddata_write(&crypto->DDATA4, &T[i]->Y);
    CORE_EXIT_CRITICAL();

    /* Z_inv  already in DDATA2 */
    CRYPTO_EXECUTE_3(crypto,
                     CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL);
    CRYPTO_InstructionSequenceWait(crypto);
    CRYPTO_EXECUTE_3(crypto,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                     CRYPTO_CMD_INSTR_MMUL);
    CRYPTO_InstructionSequenceWait(crypto);
    CRYPTO_EXECUTE_3(crypto,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL);
    CRYPTO_InstructionSequenceWait(crypto);
    CRYPTO_EXECUTE_3(crypto,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                     CRYPTO_CMD_INSTR_MMUL);
    CRYPTO_InstructionSequenceWait(crypto);

    SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &T[i]->Y));
    SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA3, &T[i]->X));

    /*
     * Post-precessing: reclaim some memory by shrinking coordinates
     * - not storing Z (always 1)
     * - shrinking other coordinates, but still keeping the same number of
     *   limbs as P, as otherwise it will too likely be regrown too fast.
     */
    SLCL_ECP_CHK(mbedtls_mpi_shrink(&T[i]->X, grp->P.n) );
    SLCL_ECP_CHK(mbedtls_mpi_shrink(&T[i]->Y, grp->P.n) );
    mbedtls_mpi_free(&T[i]->Z);

