espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_mbedtls_support/src/crypto_ecp.c
    if ( i == 0 ) {
      break;
    }
  }

  cleanup:
  crypto_management_release(crypto);
  mbedtls_free(cc);

  return(ret);
}
#endif /* MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT */

/**
 * \brief           Normalize jacobian coordinates so that Z == 0 || Z == 1.
 *
 *                  Cost in field operations if done by [5] 3.2.1:
 *                      1N := 1I + 3M + 1S
 *
 * \param grp       Pointer to the group representing the curve.
 *
 * \param pt        pointer to the point to be normalised. This is an
 *                  input/output parameter.
 *
 * \return          0 if successful.
 */
#if defined(MBEDTLS_ECP_NORMALIZE_JAC_ALT)
int mbedtls_internal_ecp_normalize_jac(const mbedtls_ecp_group *grp,
                                       mbedtls_ecp_point *pt)
{
  int             ret      = 0;
  CORE_DECLARE_IRQ_STATE;
  CRYPTO_TypeDef *crypto = crypto_management_acquire();

  ecp_crypto_device_init(crypto, grp);

  ecc_bigint_t    one = { 0 };
  ecc_bigint_t    Z;
  ecc_bigint_t    modulus;
  ecc_bigint_t    Z_inv;

  bigint_set_bytes(one, 1, 0, 1);

  MPI_TO_BIGINT(Z, &pt->Z);
  MPI_TO_BIGINT(modulus, &grp->P);

  crypto_mpi_div_mod(crypto, one, Z, modulus, Z_inv);

  /*

     Goals:
     R->X = P->X * Z_inv ^2
     R->Y = P->Y * Z_inv ^3

     Write Operations:

     R1 = Z_inv
     R3 = P->X
     R4 = P->Y

     Instructions to be executed:

     1.  R2 = R1 = Z_inv
     2.  Select R1, R2
     3.  R0 = R1 * R2 = Z_inv^2
     4.  R1 = R0 = Z_inv^2
     5.  Select R1, R3
     6.  R0 = R1 * R3 = P->X * Z_inv^2 = R->X
     7.  R3 = R0
     8.  Select R1, R2
     9.  R0 = R1 * R2 = Z_inv^3
     10. R1 = R0 = Z_inv^3
     11. Select R1, R4
     12. R0 = R1 * R4 = P->Y * Z_inv^3 = R->Y

     Read Operations:

     R->Y = R0 = P->Y * P->Z_inv^3
     R->X = R3 = P->X * P->Z_inv^2

   */
  CORE_ENTER_CRITICAL();
  CRYPTO_DDataWrite(&crypto->DDATA1, Z_inv);
  ecp_crypto_ddata_write(&crypto->DDATA3, &pt->X);
  ecp_crypto_ddata_write(&crypto->DDATA4, &pt->Y);
  CORE_EXIT_CRITICAL();

  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA1TODDATA2,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                   CRYPTO_CMD_INSTR_MMUL);
  CRYPTO_InstructionSequenceWait(crypto);

  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA0, &pt->Y));
  SLCL_ECP_CHK(ecp_crypto_ddata_read(&crypto->DDATA3, &pt->X));

  crypto_management_release(crypto);

  /*
   * Z = 1
   */
  SLCL_ECP_CHK(mbedtls_mpi_lset(&pt->Z, 1) );

  cleanup:
  return(ret);
}
#endif /* MBEDTLS_ECP_NORMALIZE_JAC_ALT */

#endif /* MBEDTLS_ECP_SHORT_WEIERSTRASS_ENABLED */

#endif /* #if defined( MBEDTLS_ECP_INTERNAL_ALT ) */

#endif /* #if defined( MBEDTLS_ECP_C ) */

#endif /* #if defined( CRYPTO_PRESENT ) */
